###############################################################################
# Created by write_sdc
# Wed Feb 26 03:12:11 2025
###############################################################################
current_design Proc
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {dmemreq_type}]
set_load -pin_load 0.1900 [get_ports {dmemreq_val}]
set_load -pin_load 0.1900 [get_ports {imemreq_val}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[31]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[30]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[29]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[28]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[27]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[26]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[25]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[24]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[23]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[22]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[21]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[20]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[19]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[18]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[17]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[16]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[15]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[14]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[13]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[12]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[11]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[10]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[9]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[8]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[7]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[6]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[5]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[4]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[3]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[2]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[1]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_addr[0]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[31]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[30]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[29]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[28]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[27]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[26]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[25]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[24]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[23]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[22]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[21]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[20]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[19]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[18]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[17]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[16]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[15]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[14]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[13]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[12]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[11]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[10]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[9]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[8]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[7]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[6]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[5]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[4]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[3]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[2]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[1]}]
set_load -pin_load 0.1900 [get_ports {dmemreq_wdata[0]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[31]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[30]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[29]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[28]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[27]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[26]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[25]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[24]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[23]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[22]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[21]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[20]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[19]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[18]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[17]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[16]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[15]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[14]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[13]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[12]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[11]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[10]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[9]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[8]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[7]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[6]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[5]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[4]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[3]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[2]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[1]}]
set_load -pin_load 0.1900 [get_ports {imemreq_addr[0]}]
set_load -pin_load 0.1900 [get_ports {out0[31]}]
set_load -pin_load 0.1900 [get_ports {out0[30]}]
set_load -pin_load 0.1900 [get_ports {out0[29]}]
set_load -pin_load 0.1900 [get_ports {out0[28]}]
set_load -pin_load 0.1900 [get_ports {out0[27]}]
set_load -pin_load 0.1900 [get_ports {out0[26]}]
set_load -pin_load 0.1900 [get_ports {out0[25]}]
set_load -pin_load 0.1900 [get_ports {out0[24]}]
set_load -pin_load 0.1900 [get_ports {out0[23]}]
set_load -pin_load 0.1900 [get_ports {out0[22]}]
set_load -pin_load 0.1900 [get_ports {out0[21]}]
set_load -pin_load 0.1900 [get_ports {out0[20]}]
set_load -pin_load 0.1900 [get_ports {out0[19]}]
set_load -pin_load 0.1900 [get_ports {out0[18]}]
set_load -pin_load 0.1900 [get_ports {out0[17]}]
set_load -pin_load 0.1900 [get_ports {out0[16]}]
set_load -pin_load 0.1900 [get_ports {out0[15]}]
set_load -pin_load 0.1900 [get_ports {out0[14]}]
set_load -pin_load 0.1900 [get_ports {out0[13]}]
set_load -pin_load 0.1900 [get_ports {out0[12]}]
set_load -pin_load 0.1900 [get_ports {out0[11]}]
set_load -pin_load 0.1900 [get_ports {out0[10]}]
set_load -pin_load 0.1900 [get_ports {out0[9]}]
set_load -pin_load 0.1900 [get_ports {out0[8]}]
set_load -pin_load 0.1900 [get_ports {out0[7]}]
set_load -pin_load 0.1900 [get_ports {out0[6]}]
set_load -pin_load 0.1900 [get_ports {out0[5]}]
set_load -pin_load 0.1900 [get_ports {out0[4]}]
set_load -pin_load 0.1900 [get_ports {out0[3]}]
set_load -pin_load 0.1900 [get_ports {out0[2]}]
set_load -pin_load 0.1900 [get_ports {out0[1]}]
set_load -pin_load 0.1900 [get_ports {out0[0]}]
set_load -pin_load 0.1900 [get_ports {out1[31]}]
set_load -pin_load 0.1900 [get_ports {out1[30]}]
set_load -pin_load 0.1900 [get_ports {out1[29]}]
set_load -pin_load 0.1900 [get_ports {out1[28]}]
set_load -pin_load 0.1900 [get_ports {out1[27]}]
set_load -pin_load 0.1900 [get_ports {out1[26]}]
set_load -pin_load 0.1900 [get_ports {out1[25]}]
set_load -pin_load 0.1900 [get_ports {out1[24]}]
set_load -pin_load 0.1900 [get_ports {out1[23]}]
set_load -pin_load 0.1900 [get_ports {out1[22]}]
set_load -pin_load 0.1900 [get_ports {out1[21]}]
set_load -pin_load 0.1900 [get_ports {out1[20]}]
set_load -pin_load 0.1900 [get_ports {out1[19]}]
set_load -pin_load 0.1900 [get_ports {out1[18]}]
set_load -pin_load 0.1900 [get_ports {out1[17]}]
set_load -pin_load 0.1900 [get_ports {out1[16]}]
set_load -pin_load 0.1900 [get_ports {out1[15]}]
set_load -pin_load 0.1900 [get_ports {out1[14]}]
set_load -pin_load 0.1900 [get_ports {out1[13]}]
set_load -pin_load 0.1900 [get_ports {out1[12]}]
set_load -pin_load 0.1900 [get_ports {out1[11]}]
set_load -pin_load 0.1900 [get_ports {out1[10]}]
set_load -pin_load 0.1900 [get_ports {out1[9]}]
set_load -pin_load 0.1900 [get_ports {out1[8]}]
set_load -pin_load 0.1900 [get_ports {out1[7]}]
set_load -pin_load 0.1900 [get_ports {out1[6]}]
set_load -pin_load 0.1900 [get_ports {out1[5]}]
set_load -pin_load 0.1900 [get_ports {out1[4]}]
set_load -pin_load 0.1900 [get_ports {out1[3]}]
set_load -pin_load 0.1900 [get_ports {out1[2]}]
set_load -pin_load 0.1900 [get_ports {out1[1]}]
set_load -pin_load 0.1900 [get_ports {out1[0]}]
set_load -pin_load 0.1900 [get_ports {out2[31]}]
set_load -pin_load 0.1900 [get_ports {out2[30]}]
set_load -pin_load 0.1900 [get_ports {out2[29]}]
set_load -pin_load 0.1900 [get_ports {out2[28]}]
set_load -pin_load 0.1900 [get_ports {out2[27]}]
set_load -pin_load 0.1900 [get_ports {out2[26]}]
set_load -pin_load 0.1900 [get_ports {out2[25]}]
set_load -pin_load 0.1900 [get_ports {out2[24]}]
set_load -pin_load 0.1900 [get_ports {out2[23]}]
set_load -pin_load 0.1900 [get_ports {out2[22]}]
set_load -pin_load 0.1900 [get_ports {out2[21]}]
set_load -pin_load 0.1900 [get_ports {out2[20]}]
set_load -pin_load 0.1900 [get_ports {out2[19]}]
set_load -pin_load 0.1900 [get_ports {out2[18]}]
set_load -pin_load 0.1900 [get_ports {out2[17]}]
set_load -pin_load 0.1900 [get_ports {out2[16]}]
set_load -pin_load 0.1900 [get_ports {out2[15]}]
set_load -pin_load 0.1900 [get_ports {out2[14]}]
set_load -pin_load 0.1900 [get_ports {out2[13]}]
set_load -pin_load 0.1900 [get_ports {out2[12]}]
set_load -pin_load 0.1900 [get_ports {out2[11]}]
set_load -pin_load 0.1900 [get_ports {out2[10]}]
set_load -pin_load 0.1900 [get_ports {out2[9]}]
set_load -pin_load 0.1900 [get_ports {out2[8]}]
set_load -pin_load 0.1900 [get_ports {out2[7]}]
set_load -pin_load 0.1900 [get_ports {out2[6]}]
set_load -pin_load 0.1900 [get_ports {out2[5]}]
set_load -pin_load 0.1900 [get_ports {out2[4]}]
set_load -pin_load 0.1900 [get_ports {out2[3]}]
set_load -pin_load 0.1900 [get_ports {out2[2]}]
set_load -pin_load 0.1900 [get_ports {out2[1]}]
set_load -pin_load 0.1900 [get_ports {out2[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
